In [43]:
import pandas as pd

In [44]:
dados = pd.read_csv('dados/aluguel_residencial.csv', sep=";")
dados.head(3)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,42.50,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,70.00,Casa
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento

In [45]:
dados['Valor'].mean()

5046.172821405663

In [46]:
bairros = ['Copacabana', 'Ipanema', 'Jardim Botânico']
selecao = dados['Bairro'].isin(bairros)
dados = dados[selecao]

In [47]:
dados['Bairro'].drop_duplicates()

0          Copacabana
1     Jardim Botânico
19            Ipanema
Name: Bairro, dtype: object

In [48]:
grupo_bairros = dados.groupby('Bairro')

In [49]:
grupo_bairros.groups

{'Copacabana': [0, 9, 10, 11, 24, 25, 28, 31, 86, 91, 104, 109, 125, 129, 140, 142, 143, 151, 162, 174, 184, 192, 194, 206, 223, 249, 263, 275, 278, 281, 289, 290, 301, 307, 319, 327, 329, 348, 359, 365, 371, 372, 388, 396, 404, 425, 426, 437, 458, 460, 485, 486, 487, 497, 530, 532, 534, 557, 564, 573, 574, 583, 606, 610, 612, 615, 633, 650, 659, 666, 667, 678, 687, 689, 694, 701, 713, 730, 736, 739, 772, 808, 824, 836, 872, 881, 894, 898, 907, 912, 917, 919, 921, 922, 929, 952, 963, 964, 980, 989, ...], 'Ipanema': [19, 39, 40, 45, 52, 53, 73, 84, 92, 114, 121, 128, 141, 159, 177, 179, 216, 217, 230, 242, 245, 269, 283, 326, 338, 341, 370, 377, 386, 392, 405, 444, 482, 489, 515, 523, 535, 569, 575, 576, 577, 579, 589, 591, 614, 624, 628, 647, 648, 656, 671, 681, 690, 708, 710, 717, 725, 729, 731, 746, 747, 753, 757, 779, 783, 792, 800, 810, 812, 816, 829, 859, 860, 877, 888, 905, 906, 923, 927, 938, 951, 953, 970, 983, 985, 994, 1001, 1010, 1022, 1027, 1033, 1049, 1050, 1052, 1054, 1058, 1060, 1078, 1086, 1092, ...], 'Jardim Botânico': [1, 55, 310, 323, 351, 445, 446, 492, 495, 571, 643, 675, 806, 937, 982, 1187, 1211, 1374, 1484, 1795, 1884, 2053, 2061, 2102, 2249, 2523, 2526, 2692, 2712, 2731, 2813, 2817, 3214, 3370, 3473, 3486, 3583, 3735, 3764, 3782, 3961, 4059, 4062, 4121, 4237, 4472, 4585, 4702, 4709, 4789, 4866, 4889, 4914, 5024, 5084, 5116, 5168, 5198, 5232, 5262, 5301, 5341, 5382, 5399, 5418, 5598, 5665, 5702, 5809, 5836, 5886, 6276, 6326, 6399, 6484, 6512, 6643, 6736, 6740, 6741, 6745, 6773, 6789, 6813, 6908, 6921, 6971, 7001, 7055, 7113, 7357, 7362, 7469, 7528, 7734, 7878, 7916, 8050, 8171, 8201, ...]}

In [50]:
for bairro, data in grupo_bairros:
    print('{} -> {}'.format(bairro, data.Valor.mean()))

Copacabana -> 4126.677004538578
Ipanema -> 9352.001133786847
Jardim Botânico -> 8722.357414448668

In [51]:
grupo_bairros[['Valor', 'Condominio']].mean().round(2)

                   Valor  Condominio
Bairro
Copacabana       4126.68     1148.68
Ipanema          9352.00     2244.44
Jardim Botânico  8722.36     1059.24

In [52]:
grupo_bairros['Valor'].describe().round(2)

,count,mean,std,min,25%,50%,75%,max
Bairro,,,,,,,,
Copacabana,2644.0,4126.68,3611.41,100.0,2000.0,3000.0,4800.0,35000.0
Ipanema,1764.0,9352.00,8219.72,1200.0,4500.0,7000.0,11000.0,90000.0
Jardim Botânico,263.0,8722.36,9332.73,1550.0,3150.0,4000.0,10000.0,50000.0

In [53]:
grupo_bairros['Valor'].aggregate(['min', 'max', 'sum']).rename(columns = {'min': 'Mínimo', 'max': 'Máximo', 'sum': 'Soma'})

                 Mínimo   Máximo        Soma
Bairro
Copacabana        100.0  35000.0  10910934.0
Ipanema          1200.0  90000.0  16496930.0
Jardim Botânico  1550.0  50000.0   2293980.0

In [54]:
%matplotlib inline
import matplotlib.pyploty as plt
plt.rc('figure', figsize = (20,10))

ModuleNotFoundError: No module named 'matplotlib.pyploty'

In [ ]:
grupo_bairros['Valor'].std().